'use client'

import { useEffect } from 'react'

export default function ConsoleGreeting() {
    useEffect(() => {
        const styles = {
            title: 'font-size: 32px; font-weight: bold; color: #fff; text-shadow: 2px 2px 4px rgba(0,0,0,0.5);',
            subtitle: 'font-size: 20px; font-weight: bold; color: #fff; text-shadow: 2px 2px 4px rgba(0,0,0,0.5);',
        }

        console.clear()

        console.log('%c' + `
 ██████╗  █████╗ ██████╗ ██████╗ ██╗   ██╗███████╗██╗     
██╔════╝ ██╔══██╗██╔══██╗██╔══██╗╚██╗ ██╔╝██╔════╝██║     
██║  ███╗███████║██████╔╝██████╔╝ ╚████╔╝ █████╗  ██║     
██║   ██║██╔══██║██╔══██╗██╔══██╗  ╚██╔╝  ██╔══╝  ██║     
╚██████╔╝██║  ██║██████╔╝██║  ██║   ██║   ███████╗███████╗
 ╚═════╝ ╚═╝  ╚═╝╚═════╝ ╚═╝  ╚═╝   ╚═╝   ╚══════╝╚══════╝
                                                           
██╗  ██╗ █████╗ ██████╗ ███╗   ███╗ ██████╗              
██║ ██╔╝██╔══██╗██╔══██╗████╗ ████║██╔═══██╗             
█████╔╝ ███████║██║  ██║██╔████╔██║██║   ██║             
██╔═██╗ ██╔══██║██║  ██║██║╚██╔╝██║██║   ██║             
██║  ██╗██║  ██║██████╔╝██║ ╚═╝ ██║╚██████╔╝             
╚═╝  ╚═╝╚═╝  ╚═╝╚═════╝ ╚═╝     ╚═╝ ╚═════╝              
        `, 'color: #00ff88;')
        console.log('%c👋 Olá, Curió!😏', styles.title)
        console.log('%cEntre em contato: contato@kadmo.tech', styles.subtitle)
    }, [])

    return null
}
